In [1]:
from pandas import DataFrame
df=DataFrame(
                [[19,14,18,19],
                 [18,10,17,16],
                 [17,16,18,15]
                ]
                ,columns=['OSA','JAVA','SE','DS']
            )
df

   OSA  JAVA  SE  DS
0   19    14  18  19
1   18    10  17  16
2   17    16  18  15

In [2]:
df.sum()

OSA     54
JAVA    40
SE      53
DS      50
dtype: int64

In [3]:
df.max()

OSA     19
JAVA    16
SE      18
DS      19
dtype: int64

In [4]:
df.min()

OSA     17
JAVA    10
SE      17
DS      15
dtype: int64

In [5]:
df.mean()

OSA     18.000000
JAVA    13.333333
SE      17.666667
DS      16.666667
dtype: float64

In [6]:
df.count()

OSA     3
JAVA    3
SE      3
DS      3
dtype: int64

In [7]:
df.size()

TypeError: 'numpy.int32' object is not callable

In [8]:
df.first()

TypeError: first() missing 1 required positional argument: 'offset'

In [9]:
df.last()

TypeError: last() missing 1 required positional argument: 'offset'

In [10]:
df.describe()

        OSA       JAVA         SE         DS
count   3.0   3.000000   3.000000   3.000000
mean   18.0  13.333333  17.666667  16.666667
std     1.0   3.055050   0.577350   2.081666
min    17.0  10.000000  17.000000  15.000000
25%    17.5  12.000000  17.500000  15.500000
50%    18.0  14.000000  18.000000  16.000000
75%    18.5  15.000000  18.000000  17.500000
max    19.0  16.000000  18.000000  19.000000

In [12]:
df.agg(['sum','min','max','std'])

      OSA      JAVA        SE         DS
sum  54.0  40.00000  53.00000  50.000000
min  17.0  10.00000  17.00000  15.000000
max  19.0  16.00000  18.00000  19.000000
std   1.0   3.05505   0.57735   2.081666

In [13]:
df.prod()

OSA     5814
JAVA    2240
SE      5508
DS      4560
dtype: int64

In [15]:
df.median()

OSA     18.0
JAVA    14.0
SE      18.0
DS      16.0
dtype: float64

In [29]:
from pandas import DataFrame
df1=DataFrame(
                [
                    ["aryan","singh","fulltime","administration",2,20000],
                    ["rohan","agarwal","intern","technical",3,5000],
                    ["riya","shah","fulltime","administration",5,10000],
                    ["yash","bhatiya","parttime","technical",7,10000],
                    ["siddhant","khanna","fulltime","management",6,20000]
                ]
                ,columns=["first Name","last name","type","department","YoE","Salary"]
            )
df1

  first Name last name      type      department  YoE  Salary
0      aryan     singh  fulltime  administration    2   20000
1      rohan   agarwal    intern       technical    3    5000
2       riya      shah  fulltime  administration    5   10000
3       yash   bhatiya  parttime       technical    7   10000
4   siddhant    khanna  fulltime      management    6   20000

In [30]:
df1.groupby(['type']).sum()

          YoE  Salary
type
fulltime   13   50000
intern      3    5000
parttime    7   10000

In [31]:
df1.groupby(['type']).mean()

               YoE        Salary
type
fulltime  4.333333  16666.666667
intern    3.000000   5000.000000
parttime  7.000000  10000.000000

In [32]:
df1.groupby(['type','department']).sum()

                         YoE  Salary
type     department
fulltime administration    7   30000
         management        6   20000
intern   technical         3    5000
parttime technical         7   10000

In [33]:
df1.groupby(['department','type']).sum()

                         YoE  Salary
department     type
administration fulltime    7   30000
management     fulltime    6   20000
technical      intern      3    5000
               parttime    7   10000

In [34]:
df1.groupby(['type','department']).mean()

                         YoE   Salary
type     department
fulltime administration  3.5  15000.0
         management      6.0  20000.0
intern   technical       3.0   5000.0
parttime technical       7.0  10000.0

In [35]:
df1.groupby(['type','department']).median()

                         YoE   Salary
type     department
fulltime administration  3.5  15000.0
         management      6.0  20000.0
intern   technical       3.0   5000.0
parttime technical       7.0  10000.0